---
type: LoadCombination
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 10
tags: [revit-api, class]
---

# LoadCombination

`Autodesk.Revit.DB.Structure.LoadCombination` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | GetCaseAndCombinationIds | 2016 | `public IList < ElementId > GetCaseAndCombinationIds ()` |
| Method | GetComponents | 2016 | `public IList < LoadComponent > GetComponents ()` |
| Method | GetUsageIds | 2016 | `public IList < ElementId > GetUsageIds ()` |
| Method | SetComponents | 2016 | `public void SetComponents ( IList < LoadComponent > components )` |
| Method | SetUsageIds | 2016 | `public void SetUsageIds ( IList < ElementId > usageIds )` |
| Property | IsThirdPartyGenerated | 2016 | `public bool IsThirdPartyGenerated { get ; }` |
| Property | Parameter | — | `` |
| Property | State | 2016 | `public LoadCombinationState State { get ; set ; }` |
| Property | Type | 2016 | `public LoadCombinationType Type { get ; set ; }` |